locationlist={}
locationlist['北部']={'基隆市':{'基隆':1,'彭佳嶼':24},'臺北市':{'竹子湖':4,'鞍部':5,'臺北':31},'新北市':{'淡水':2,'板橋':3,'新店':30},'桃園市':{'拉拉山':27,'新屋':37},'新竹縣':{'新竹':6}}
locationlist['中部']={'臺中市':{'臺中':7,'梧棲':8,'武陵':28},'彰化縣':{'彰師大':32},'南投縣':{'日月潭':10,'玉山':12},'雲林縣':{'麥寮':36,'古坑':39},'嘉義市':{'嘉義':13},'嘉義縣':{'阿里山':11}}
locationlist['南部']={'臺南市':{'臺南':14,'永康':26},'高雄市':{'高雄':15},'屏東縣':{'恆春':16}}
locationlist['東部']={'宜蘭縣':{'宜蘭':17,'蘇澳':18},'花蓮縣':{'花蓮':19,'太魯閣':29},'臺東縣':{'成功':20,'臺東':21,'大武':22,'蘭嶼':23}}
locationlist['外島']={'澎湖縣':{'澎湖':9,'東吉島':25,'吉貝':33},'金門縣':{'金門':34},'連江縣':{'馬祖':35,'九宮碼頭':38}}
#puts locationlist
locationlist['北部'].each do |key, value|
  #puts key
  value.each do |k,v|
    puts k
    puts v
  end
end
puts locationlist['北部'].values[1].keys[0]
puts locationlist['北部'].values[1].values[0]

result = []
for i in 0..5
  puts "HI: "+ i.to_s
  result[i] = i
end

puts result